БухЭксп/Catalogs/CW_СистемныеСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_СистемныеСообщения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ИсточникиСистемныхСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПриоритетыСистемныхСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокСсылок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СсылкаСообщения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДанныеСообщения</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ФильтрыСистемныхСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ФильтрыСистемныхСообщений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Использование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборПоПриоритету</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантФильтрацииПоИсточнику</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Приоритеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ПриоритетыСистемныхСообщений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Источники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Источник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ИсточникиСистемныхСообщений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ВидыПолучателейЭлектронныхПисем</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтображаемоеИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_СистемныеСообщения/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПравоОткрытия = CW_ПраваДоступа.ПравоДоступно("ПросмотрСистемныхСообщений");
	Если (НЕ ПравоОткрытия) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
	Список.Отбор.Элементы.Очистить();
	_ЗагрузитьСеансовыеНастройки();
	
	Параметры.Свойство("Фильтр",Фильтр);
	Если НЕ Фильтр.Пустая() Тогда
		
		_ФильтрПриИзменении();
		
	Иначе
		
		_НастройкаСписка();
		
	КонецЕсли; 
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	//_СохранитьСеансовыеНастройки();
	
КонецПроцедуры
 
// --- 

&НаСервере
Функция _СохранитьСеансовыеНастройки()
	// --- 
	
	СтруктураНастроекФормы = Новый Структура;
	СтруктураНастроекФормы.Вставить("ТолькоНовые",ТолькоНовые);
	СтруктураНастроекФормы.Вставить("ТолькоВажные",ТолькоВажные);
	
	УстановитьПривилегированныйРежим(Истина);
	ХранилищеСистемныхНастроек.Сохранить(ЭтаФорма.ИмяФормы,"ПоследняяНастройка",СтруктураНастроекФормы,,ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);	
	УстановитьПривилегированныйРежим(Ложь);
	
	// --- 
КонецФункции

&НаСервере
Функция _ЗагрузитьСеансовыеНастройки()
	// --- 
	
	УстановитьПривилегированныйРежим(Истина);
	ПоследняяНастройка = ХранилищеСистемныхНастроек.Загрузить(ЭтаФорма.ИмяФормы,"ПоследняяНастройка",,ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);	
	УстановитьПривилегированныйРежим(Ложь);
	Если ПоследняяНастройка <> Неопределено Тогда
		
		ПоследняяНастройка.Свойство("ТолькоНовые",ТолькоНовые);
		ПоследняяНастройка.Свойство("ТолькоВажные",ТолькоВажные);
		
	КонецЕсли; 
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ТолькоНовые(Команда)
	
	ТолькоНовые = НЕ ТолькоНовые;
	_НастройкаСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ТолькоВажные(Команда)
	
	ТолькоВажные = НЕ ТолькоВажные;
	_НастройкаСписка();
	
КонецПроцедуры

// --- 

&НаСервере
Процедура _НастройкаСписка()
	// --- 
	
	Элементы.ФормаТолькоНовые.Пометка = ТолькоНовые;
	Элементы.ФормаТолькоВажные.Пометка = ТолькоВажные;
	
	// ---------------------------------------------------------------------------- 
	
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
	Если ТолькоНовые Тогда
		
		СтрокаОтбораНовых = Неопределено;
		Для каждого СтрокаОтбора Из Список.Отбор.Элементы Цикл
			
			Если (СтрокаОтбора.ЛевоеЗначение = ПолеКомпоновки) Тогда
				
				СтрокаОтбораНовых = СтрокаОтбора;
				
			КонецЕсли; 
			
		КонецЦикла;
		Если (СтрокаОтбораНовых = Неопределено) Тогда
			
			_УФС.ДобавитьОтбор(Список.Отбор,"ПометкаУдаления",,Ложь);
			
		Иначе
			
			СтрокаОтбораНовых.Использование = Истина;
			
		КонецЕсли; 
		
	Иначе
		
		 Для каждого СтрокаОтбора Из Список.Отбор.Элементы Цикл
			
			Если (СтрокаОтбора.ЛевоеЗначение = ПолеКомпоновки) Тогда
				
				СтрокаОтбора.Использование = Ложь;
				
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных("Важное");
	Если ТолькоВажные Тогда
		
		СтрокаОтбораВажных = Неопределено;
		Для каждого СтрокаОтбора Из Список.Отбор.Элементы Цикл
			
			Если (СтрокаОтбора.ЛевоеЗначение = ПолеКомпоновки) Тогда
				
				СтрокаОтбораВажных = СтрокаОтбора;
				
			КонецЕсли; 
			
		КонецЦикла;
		Если (СтрокаОтбораВажных = Неопределено) Тогда
			
			_УФС.ДобавитьОтбор(Список.Отбор,"Важное",,Истина);
			
		Иначе
			
			СтрокаОтбораВажных.Использование = Истина;
			
		КонецЕсли; 
		
	Иначе
		
		Для каждого СтрокаОтбора Из Список.Отбор.Элементы Цикл
			
			Если (СтрокаОтбора.ЛевоеЗначение = ПолеКомпоновки) Тогда
				
				СтрокаОтбора.Использование = Ложь;
				
			КонецЕсли; 
			
		КонецЦикла; 
				
	КонецЕсли; 
	
	// --- 
	_СохранитьСеансовыеНастройки();
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ОтправитьПоЭлектроннойПочте(Команда)
	
	ПФ = Новый Структура("СтруктураПисьма",_ПолучитьСП(Элементы.Список.ВыделенныеСтроки));
	ОткрытьФорму("Обработка.CW_ОтправкаПочты.Форма.Форма",ПФ);
	
КонецПроцедуры

&НаСервере
Функция _ПолучитьСП(Знач МассивВыделенныхСтрок)
	// --- 
	
	// сортируем по дате сообщения
	ТЗ = _сф.т_Создать("Ссылка,Дата");
	Для каждого Стр Из МассивВыделенныхСтрок Цикл
		
		Нстр = ТЗ.Добавить();
		Нстр.Ссылка = Стр;
		Нстр.Дата = Стр.Дата;
		
	КонецЦикла; 
	ТЗ.Сортировать("Дата Возр");
	МассивВыделенныхСтрок = ТЗ.ВыгрузитьКолонку("Ссылка");
	// --- 
	
	СП = _ЭП.СтруктураПисьма();
	// --- 
	УЗ = CW_Настройки.ПолучитьНастройкуПользователя(,"УчетнаяЗаписьЭлектроннойПочты");
	Если УЗ <> Неопределено Тогда
		
		СП.Отправитель = УЗ;
		
	КонецЕсли; 
	// --- 
	_ЭП.ДобавитьТекст(СП,CW_Журнал.СформироватьТекстПисьма(МассивВыделенныхСтрок));
	// --- 
	
	Возврат(ПоместитьВоВременноеХранилище(СП,ЭтаФорма.УникальныйИдентификатор));
	
	// --- 
КонецФункции
 

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Фильтры(Команда)
	
	ОткрытьФорму("Справочник.CW_ФильтрыСистемныхСообщений.ФормаСписка");
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ФильтрПриИзменении(Элемент)
	
	_ФильтрПриИзменении();
	
КонецПроцедуры

&НаСервере
Процедура _ФильтрПриИзменении()
	// --- 
	
	Список.Отбор.Элементы.Очистить();
	
	Если НЕ Фильтр.Пустая() Тогда
		
		// добавляем условия:
		
		// 1. приоритеты
		Если Фильтр.ОтборПоПриоритету Тогда
			
			Если Фильтр.Приоритеты.Количество() <> 0 Тогда
				
				Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Приоритет");
				Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
				Отбор.ПравоеЗначение = Фильтр.Приоритеты.ВыгрузитьКолонку("Приоритет");
				Отбор.Использование = Истина;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		// 2. источники
		Если Фильтр.ВариантФильтрацииПоИсточнику <> 0 Тогда
			
			Если Фильтр.Источники.Количество() <> 0 Тогда
				
				Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Источник");
				Отбор.ВидСравнения = ?(Фильтр.ВариантФильтрацииПоИсточнику=1,ВидСравненияКомпоновкиДанных.ВСписке,ВидСравненияКомпоновкиДанных.НеВСписке);
				Отбор.ПравоеЗначение = Фильтр.Источники.ВыгрузитьКолонку("Источник");
				Отбор.Использование = Истина;
				
			КонецЕсли; 
			
		КонецЕсли; 
				
	КонецЕсли; 
	
	_НастройкаСписка();
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура СнятьФильтр(Команда)
	
	Фильтр = Неопределено;
	_ФильтрПриИзменении();
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ПометкаВажности(Команда)
	
	_ИзменитьПометкуВажности(Элементы.Список.ТекущаяСтрока);
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура _ИзменитьПометкуВажности(Ссылка)
	// --- 
	
	СообщениеОбъект = Ссылка.ПолучитьОбъект();
	СообщениеОбъект.Важное = (НЕ СообщениеОбъект.Важное);
	СообщениеОбъект.Записать();
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтарыеСообщения(Команда)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораДаты",ЭтотОбъект, Новый Структура()); 
	ПоказатьВводДаты(ПОВ,НачалоДня(ТекущаяДата()-5*60*60*24),"Пометить сообщения старше",ЧастиДаты.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораДаты(Дата, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Дата <> Неопределено) Тогда
		
		Результат = _ПометитьНаУдалениеСообщенияДоДаты(Дата);
		Если (_УФКС.ВыполненоУспешно(Результат)) Тогда
			
			Элементы.Список.Обновить();
			ПоказатьПредупреждение(,Формат(Результат.КоличествоСообщений)+ " помечено на удаление.");
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ПометитьНаУдалениеСообщенияДоДаты(Дата)
	// --- 
	
	УстановитьПривилегированныйРежим(Истина);
	// --- 
	Если (ЗначениеЗаполнено(Фильтр)) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_СистемныеСообщения.Ссылка
		               |ИЗ
		               |	Справочник.CW_СистемныеСообщения КАК CW_СистемныеСообщения
		               |ГДЕ
		               |	CW_СистемныеСообщения.ПометкаУдаления = ЛОЖЬ
		               |	И CW_СистемныеСообщения.Дата < &Дата
		               |	И CW_СистемныеСообщения.Важное = ЛОЖЬ
		               |	И ВЫБОР
		               |			КОГДА &ОтборПоПриоритету = ЛОЖЬ
		               |				ТОГДА ИСТИНА
		               |			ИНАЧЕ CW_СистемныеСообщения.Приоритет В (&Приоритеты)
		               |		КОНЕЦ
		               |	И ВЫБОР
		               |			КОГДА &ОтборПоИсточнику = ЛОЖЬ
		               |				ТОГДА ИСТИНА
		               |			ИНАЧЕ ВЫБОР
		               |					КОГДА &ПоСписку = ИСТИНА
		               |						ТОГДА &Источник В (&Источники)
		               |					ИНАЧЕ НЕ &Источник В (&Источники)
		               |				КОНЕЦ
		               |		КОНЕЦ";
		Запрос.УстановитьПараметр("Дата", Дата);
		// --- 
		Если (Фильтр.ОтборПоПриоритету И Фильтр.Приоритеты.Количество() <> 0) Тогда
			Запрос.УстановитьПараметр("ОтборПоПриоритету", Истина);
			Запрос.УстановитьПараметр("Приоритеты",  Фильтр.Приоритеты.ВыгрузитьКолонку("Приоритет"));
		Иначе
			Запрос.УстановитьПараметр("ОтборПоПриоритету", Ложь);
		КонецЕсли;
		// --- 
		Если (Фильтр.ВариантФильтрацииПоИсточнику <> 0 И Фильтр.Источники.Количество() <> 0) Тогда
			
			Запрос.УстановитьПараметр("ОтборПоИсточнику", Истина); 
			Если (Фильтр.ВариантФильтрацииПоИсточнику=1) Тогда
				Запрос.УстановитьПараметр("ПоСписку", Истина);
			Иначе
				Запрос.УстановитьПараметр("ПоСписку", Ложь);
			КонецЕсли; 
			Запрос.УстановитьПараметр("Источники", Фильтр.Источники.ВыгрузитьКолонку("Источник")); 
			
		Иначе
			
			Запрос.УстановитьПараметр("ОтборПоИсточнику", Ложь);
			
		КонецЕсли; 
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	CW_СистемныеСообщения.Ссылка
		|ИЗ
		|	Справочник.CW_СистемныеСообщения КАК CW_СистемныеСообщения
		|ГДЕ
		|	CW_СистемныеСообщения.ПометкаУдаления = ЛОЖЬ
		|	И CW_СистемныеСообщения.Дата < &Дата
		|	И CW_СистемныеСообщения.Важное = ЛОЖЬ";
		Запрос.УстановитьПараметр("Дата", Дата);
		
	КонецЕсли; 
	
	// --- 
		// --- 
	ТЗ = Запрос.Выполнить().Выгрузить();
	КоличествоСообщений = ТЗ.Количество();
	Для каждого Стр Из ТЗ Цикл
		СообщениеОбъект = Стр.Ссылка.ПолучитьОбъект();
		СообщениеОбъект.УстановитьПометкуУдаления(Истина);
	КонецЦикла; 
	// --- 
	Ответ = _УФКС.Ответ();
	Ответ.Вставить("КоличествоСообщений",КоличествоСообщений);
	// --- 
	Возврат(Ответ);
	
	
	// --- 
КонецФункции
 

// ---------------------------------------------------------------------------- 
#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти
